import React from 'react'
import "../styles/about.css"

const About = () => {
  return (
    <section className='about' id='about'>
      <div className="about__inner">
        <h1 className="title__about">Чому ти повинен обрати саме нас?</h1>

        <div className="block">
          <h2 className="subtitle">Мета</h2>
          <p className="p__about">
          Обираючи нашу програму, ви отримуєте унікальну можливість стати справжнім майстром сучасних технологій штучного інтелекту! Наша програма не просто дає теоретичні знання, а й готує вас до розробки та впровадження інноваційних AI-рішень у різних сферах. Ви зануритеся в захоплюючий світ машинного навчання, нейронних мереж, обробки природної мови, комп’ютерного зору та аналізу великих даних – все це відкриє перед вами двері до кар’єри в найперспективніших технологічних галузях.
          </p>
        </div>
        <div className="btn-map__wrapper">
              <a 
                href="https://aidept.com.ua/course-cards" 
                className="btn-map" 
                target="_blank" 
                rel="noopener noreferrer"
              >
                <span>Карта навчальних курсів</span>
              </a>
            </div>
        <div className="block">

          <h2 className="subtitle">Ви здобудете:</h2>
          <ul>

                <strong>Базові та професійні навички:</strong>
                <ul>
                  <li>Машинне навчання: навчання з учителем, без учителя, глибоке навчання.</li>
                  <li>Робота з нейронними мережами, обробка природної мови, комп’ютерний зір.</li>
                  <li>Використання популярних AI-бібліотек (TensorFlow, PyTorch, Scikit-learn, OpenCV, NLTK, Hugging Face).</li>
                  <li>Розробка, оптимізація та впровадження AI-рішень у бізнес та виробництво.</li>
                  <li>Інженерія даних, візуалізація та аналіз великих масивів інформації.</li>
                  <li>Етичні аспекти та правове регулювання AI.</li>
                  <li>Робота з хмарними платформами (AWS, Azure, Google Cloud).</li>
                  <li>Розробка роботизованих систем та автономних пристроїв (Arduino, Raspberry Pi, NVIDIA Jetson).</li>
                  <li>Алгоритми, структури даних, принципи програмування.</li>
                  <li>Бази даних (SQL, NoSQL), операційні системи та хмарні технології.</li>
                </ul>


                <strong>Соціально-комунікативні навички:</strong>
                <ul>
                  <li>Аналітичне та критичне мислення.</li>
                  <li>Командна робота та комунікація.</li>
                  <li>Управління проєктами та адаптація до змін.</li>
                  <li>Навички презентації та пояснення складних технологій.</li>
                  <li>Співпраця з бізнес-аналітиками та клієнтами для впровадження AI-рішень.</li>
                </ul>
          </ul>
        </div>
        <div className="block">
          <h2 className="subtitle">Кар’єрні можливості</h2>
          <p className="p__about">
            Після навчання ви зможете працювати в IT-компаніях, наукових центрах, фінансових установах, медичних лабораторіях та інших високотехнологічних сферах.
          </p>
            <strong>Провідні позиції в ІТ-індустрії:</strong>
            <ul>
              <li>Фахівець з аналізу даних (Data Scientist)</li>
              <li>Інженер машинного навчання (Machine Learning Engineer)</li>
              <li>Інженер комп’ютерного зору (Computer Vision Engineer)</li>
              <li>Інженер з обробки природної мови (NLP Engineer)</li>
              <li>Інженер з робототехніки (Robotics Engineer)</li>
              <li>Інженер з роботи з великими даними (Big Data Engineer)</li>
              <li>Дослідник штучного інтелекту (AI Researcher)</li>
              <li>Менеджер продуктів на базі ШІ (AI Product Manager)</li>
              <li>Фахівець з етики та дотримання вимог у сфері ШІ (AI Ethics & Compliance Specialist)</li>
            </ul>
        </div>

      </div>
    </section>
  )
}

export default About
